ws/resources/objectRepo/xmlTemplates/MDM/HotelConfig/req_CreateCancellationPolicy.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateCancellationPolicyRQ>
         <v9:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v9:OperaContext>
         <v9:CancelPenalty HotelCode="?">
            <v91:CancelPenaltyConfig Inactive="?" Manual="?" NonRefundable="?" PolicyCode="?" Sequence="?">
               <v91:Deadline AbsoluteDeadline="?" OffsetDropTime="?" OffsetFromArrival="?" OffsetFromBookingDate="?"/>
               <v91:AmountPercent Amount="?" BasisType="?" CurrencyCode="?" Nights="?" Percent="?"/>
               <v91:PenaltyDescription/>
               <v91:OffsetUnit/>
            </v91:CancelPenaltyConfig>
         </v9:CancelPenalty>
      </v9:CreateCancellationPolicyRQ>
   </soapenv:Body>
</soapenv:Envelope>